replace ascii diagrams with mermaid.js
